tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "java"
cask "xquartz"
# GNU multiple precision arithmetic library
brew "gmp"
# Collection of portable C++ source libraries
brew "boost"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Identify or delete duplicate files
brew "fdupes"
# Command-line fuzzy finder written in Go
brew "fzf"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# NaCl networking and cryptography library
brew "libsodium"
# Utility for directing compilation
brew "make"
# Terminal-based visual file manager
brew "midnight-commander"
# NCurses Disk Usage
brew "ncdu"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python"
# File browser
brew "ranger"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Vi 'workalike' with many additional features
brew "vim", args: ["with-client-server", "with-lua", "with-luajit", "with-python3", "with-tcl"]
# JavaScript backends
brew node
# JavaScript package manager
brew "yarn"
cask "alfred"
cask "day-o"
cask "docker"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "iterm2"
cask "keepassxc"
cask "slack"
cask "the-unarchiver"
cask "virtualbox"
