tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "java"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GNU multiple precision arithmetic library
brew "gmp"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Isolated development environments using Docker
brew "docker-compose"
# CLI tool for quick access to files and directories
brew "fasd"
# Identify or delete duplicate files
brew "fdupes"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# The Haskell Tool Stack
brew "haskell-stack"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# NaCl networking and cryptography library
brew "libsodium"
# Utility for directing compilation
brew "make"
# Terminal-based visual file manager
brew "midnight-commander"
# NCurses Disk Usage
brew "ncdu"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# High-level interpreted language for numerical computing
brew "octave"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim", args: ["with-client-server", "with-lua", "with-luajit", "with-tcl"]
# Tracks most-used directories to make cd smarter
brew "z"
cask "alfred"
cask "beardedspice"
cask "day-o"
cask "docker"
cask "electrum"
cask "filezilla"
cask "firefox"
cask "font-fira-code"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "keepassxc"
cask "openoffice"
cask "seashore"
cask "skitch"
cask "skype"
cask "slack"
cask "steam"
cask "telegram"
cask "the-unarchiver"
cask "torbrowser"
cask "tunnelbear"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
cask "wineskin-winery"
cask "xquartz"
